//
// Created by ouyang on 2024/8/18.
//
#include "stdio.h"
int main(){
    int a[3][4] = {{1, 2,  3,  4},
                   {5, 6,  7,  8},
                   {9,10,11,12}};
//    printf("%d\n",a[0][0]);//1
//    printf("%p\n",&a[0][0]);//获取a[0][0]的地址值
//    printf("%p\n",a[0]);//表示a[0][0]的地址
//    printf("%p\n",a);//表示a[0]的地址
//    printf("%p\n",&a);//表示a数组的地址

//    printf("%p\n",&a[0][0]);
//    printf("%d\n",a[0][0]);
//    printf("%p\n",a[0]);
//    printf("%d\n",*(a[0]));
//    printf("%p\n",*a);
//    printf("%d\n",*(*a));


//    printf("%p\n",&a[1][0]);
//    printf("%d\n",a[1][0]);
//
//    printf("%p\n",a[1]);
//    printf("%d\n",*a[1]);
//
//    printf("%p\n",*(a+1));
//    printf("%d\n",*(*(a+1)));
    /*使用数组名，表示数组中各个相关元素的地址和值
     * &a//表示二位数组a的地址
     * a//表示a[0]的地址
     * a[0]//表示a[0][0]的地址
     *
     *1. a[0][0]相关的
     * a[0][0]的地址：,&a[0][0]，a[0]，*a
     *
     * a[0][0]的值表示,a[0][0],*(a[0]),*(*a)
     *
     *2.a[1]相关的
     * a[1]的地址：&a[1],a+1,
     *
     * 3.a[1][0]相关的
     * a[1][0]的地址：&a[1][0], *(a+1),a[1]
     * a[1][0]的值表示:a[1][0],*(*(a+1)),*a[1]
     *
     *
     * 4.a[1][2]相关的
     * a[1][2]的地址：&a[1][2], a[1]+2,*(a+1)+2
     * a[1][2]的值表示:a[1][2],*(*(a+1)+2),*a[1]+2
     */
    printf("%p\n",&a[2][2]);
    printf("%d\n",a[2][2]);

    printf("%p\n",a[2]+2);
    printf("%d\n",*a[2]+2);

    printf("%p\n",*(a+2)+2);
    printf("%d\n",*(*(a+2)+2));

    return 0;
}